Tekla.Structures.Model.UI.ClipPlaneCollection
The ClipPlaneCollection class handles the collection of the clip planes.

Tekla.Structures.Model.UI.ClipPlaneCollection._ClipPlanes
Contains all the Inputs, in the same order as they were entered

Tekla.Structures.Model.UI.ClipPlaneCollection.#ctor
Creates a new input item collection.

Tekla.Structures.Model.UI.ClipPlaneCollection.CopyTo(System.Array,System.Int32)
Copies the elements of the  to
an , starting at a particular  index.
array:
The one-dimensional  that is the destination of the elements copied from
the . The  must have zero-based indexing.
index: The zero-based index in the array at which copying begins.
Throws System.ArgumentNullException: Thrown when the array is null.
Throws System.ArgumentOutOfRangeException: Thrown when the index is less than zero.
Throws System.ArgumentException:
Thrown when the array is multidimensional, or the index is equal to or greater than the length of the array, or the number of elements
in the source  is greater than the available space from the index to
the end of the destination array.
Throws System.InvalidCastException:
Thrown when the type of the source  cannot be cast automatically to the type of
the destination array.
2

Tekla.Structures.Model.UI.ClipPlaneCollection.Count
Gets the number of elements contained in the .
2

Tekla.Structures.Model.UI.ClipPlaneCollection.IsSynchronized
Gets a value indicating whether access to the  is synchronized (thread safe).
2

Tekla.Structures.Model.UI.ClipPlaneCollection.SyncRoot
Gets an object that can be used to synchronize access to the .
2

Tekla.Structures.Model.UI.ClipPlaneCollection.GetEnumerator
Returns an enumerator that iterates through a collection.
Returns: An  object that can be used to iterate through the collection.
2